src/bsl/InformationRegisters/гкс_ЛогСобытийВебСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ЛогСобытийВебСервисов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСодержимого</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеОтвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеЗаголовковЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеЗаголовковОтвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УниверсальнаяДата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_РесурсыВебСервисов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ЛогСобытийВебСервисов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработкаКоманд

&НаКлиенте
Процедура ПоказатьЗапрос(Команда)
	
	Элементы.ГруппаЗапрос.Видимость = Истина;
	ПоказатьЗапросНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтвет(Команда)
	
	Элементы.ГруппаОтвет.Видимость = Истина;
	ПоказатьОтветНаСервере();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьЗапросНаСервере()
	
	РеквизитЗапись	= РеквизитФормыВЗначение("Запись");
	ТекстЗапроса	= РеквизитЗапись.ХранилищеЗапроса.Получить();
	Если НЕ ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	 
	Если СтрНайти(НРег(Запись.ТипСодержимого),"json") > 0 Тогда      
		
		Читатель = Новый ЧтениеJSON;               
		Читатель.УстановитьСтроку(ТекстЗапроса);
		ВремРезультат = ПрочитатьJSON(Читатель, Истина);   	
		
		Писатель = Новый ЗаписьJSON;
		Писатель.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб, Истина));
		
		ЗаписатьJSON(Писатель, ВремРезультат);
		
		ТекстЗапроса = Писатель.Закрыть();
		
	КонецЕсли;    
	
	Заголовки = РеквизитЗапись.ХранилищеЗаголовковЗапроса.Получить();
	ЗаголовкиЗапроса.Очистить();
	Если ЗначениеЗаполнено(Заголовки) Тогда
		Для Каждого КлючИЗначение Из Заголовки Цикл
			СтрокаЗаголовок = ЗаголовкиЗапроса.Добавить();
			СтрокаЗаголовок.Заголовок = КлючИЗначение.Ключ;
			СтрокаЗаголовок.Значение = КлючИЗначение.Значение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьОтветНаСервере()
	
	РеквизитЗапись	= РеквизитФормыВЗначение("Запись");
	ТекстОтвета		= РеквизитЗапись.ХранилищеОтвета.Получить();  
	Если НЕ ЗначениеЗаполнено(ТекстОтвета) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(НРег(Запись.ТипСодержимого),"json") > 0 Тогда      
		
		Читатель = Новый ЧтениеJSON;               
		Читатель.УстановитьСтроку(ТекстОтвета);
		ВремРезультат = ПрочитатьJSON(Читатель, Истина);   	
		
		Писатель = Новый ЗаписьJSON;
		Писатель.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб, Истина));
		
		ЗаписатьJSON(Писатель, ВремРезультат);
		
		ТекстОтвета = Писатель.Закрыть();
		
	КонецЕсли;   
	
	Заголовки = РеквизитЗапись.ХранилищеЗаголовковОтвета.Получить();
	ЗаголовкиЗапроса.Очистить();
	Если ЗначениеЗаполнено(Заголовки) Тогда
		Для Каждого КлючИЗначение Из Заголовки Цикл
			СтрокаЗаголовок = ЗаголовкиОтвета.Добавить();
			СтрокаЗаголовок.Заголовок = КлючИЗначение.Ключ;
			СтрокаЗаголовок.Значение = КлючИЗначение.Значение;
		КонецЦикла;
	КонецЕсли;

	
КонецПроцедуры    

#КонецОбласти
